espressif/esp-stub-lib/src/target/esp32c61/include/soc/interrupt_core0_reg.h
/*
 * SPDX-FileCopyrightText: 2025-2026 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0 OR MIT
 */

#pragma once

#ifdef __cplusplus
extern "C" {
#endif

#include <bit_utils.h>
#include "reg_base.h"

/** INTERRUPT_CORE0_WIFI_MAC_INTR_MAP_REG register
 *  WIFI_MAC_INTR mapping register
 */
#define INTERRUPT_CORE0_WIFI_MAC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x0)
/** INTERRUPT_CORE0_WIFI_MAC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_WIFI_MAC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_WIFI_MAC_INTR_MAP_M  (INTERRUPT_CORE0_WIFI_MAC_INTR_MAP_V << INTERRUPT_CORE0_WIFI_MAC_INTR_MAP_S)
#define INTERRUPT_CORE0_WIFI_MAC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_WIFI_MAC_INTR_MAP_S  0
/** INTERRUPT_CORE0_WIFI_MAC_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_WIFI_MAC_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_WIFI_MAC_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_WIFI_MAC_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_WIFI_MAC_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_WIFI_MAC_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_WIFI_MAC_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_WIFI_MAC_NMI_MAP_REG register
 *  WIFI_MAC_NMI mapping register
 */
#define INTERRUPT_CORE0_WIFI_MAC_NMI_MAP_REG (DR_REG_INTMTX_BASE + 0x4)
/** INTERRUPT_CORE0_WIFI_MAC_NMI_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_WIFI_MAC_NMI_MAP    0x0000003FU
#define INTERRUPT_CORE0_WIFI_MAC_NMI_MAP_M  (INTERRUPT_CORE0_WIFI_MAC_NMI_MAP_V << INTERRUPT_CORE0_WIFI_MAC_NMI_MAP_S)
#define INTERRUPT_CORE0_WIFI_MAC_NMI_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_WIFI_MAC_NMI_MAP_S  0
/** INTERRUPT_CORE0_WIFI_MAC_NMI_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_WIFI_MAC_NMI_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_WIFI_MAC_NMI_PASS_IN_SEC_M  (INTERRUPT_CORE0_WIFI_MAC_NMI_PASS_IN_SEC_V << INTERRUPT_CORE0_WIFI_MAC_NMI_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_WIFI_MAC_NMI_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_WIFI_MAC_NMI_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_WIFI_PWR_INTR_MAP_REG register
 *  WIFI_PWR_INTR mapping register
 */
#define INTERRUPT_CORE0_WIFI_PWR_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x8)
/** INTERRUPT_CORE0_WIFI_PWR_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_WIFI_PWR_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_WIFI_PWR_INTR_MAP_M  (INTERRUPT_CORE0_WIFI_PWR_INTR_MAP_V << INTERRUPT_CORE0_WIFI_PWR_INTR_MAP_S)
#define INTERRUPT_CORE0_WIFI_PWR_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_WIFI_PWR_INTR_MAP_S  0
/** INTERRUPT_CORE0_WIFI_PWR_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_WIFI_PWR_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_WIFI_PWR_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_WIFI_PWR_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_WIFI_PWR_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_WIFI_PWR_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_WIFI_PWR_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_WIFI_BB_INTR_MAP_REG register
 *  WIFI_BB_INTR mapping register
 */
#define INTERRUPT_CORE0_WIFI_BB_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xc)
/** INTERRUPT_CORE0_WIFI_BB_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_WIFI_BB_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_WIFI_BB_INTR_MAP_M  (INTERRUPT_CORE0_WIFI_BB_INTR_MAP_V << INTERRUPT_CORE0_WIFI_BB_INTR_MAP_S)
#define INTERRUPT_CORE0_WIFI_BB_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_WIFI_BB_INTR_MAP_S  0
/** INTERRUPT_CORE0_WIFI_BB_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_WIFI_BB_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_WIFI_BB_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_WIFI_BB_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_WIFI_BB_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_WIFI_BB_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_WIFI_BB_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_BT_MAC_INTR_MAP_REG register
 *  BT_MAC_INTR mapping register
 */
#define INTERRUPT_CORE0_BT_MAC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x10)
/** INTERRUPT_CORE0_BT_MAC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_BT_MAC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_BT_MAC_INTR_MAP_M  (INTERRUPT_CORE0_BT_MAC_INTR_MAP_V << INTERRUPT_CORE0_BT_MAC_INTR_MAP_S)
#define INTERRUPT_CORE0_BT_MAC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_BT_MAC_INTR_MAP_S  0
/** INTERRUPT_CORE0_BT_MAC_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_BT_MAC_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_BT_MAC_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_BT_MAC_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_BT_MAC_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_BT_MAC_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_BT_MAC_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_BT_BB_INTR_MAP_REG register
 *  BT_BB_INTR mapping register
 */
#define INTERRUPT_CORE0_BT_BB_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x14)
/** INTERRUPT_CORE0_BT_BB_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_BT_BB_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_BT_BB_INTR_MAP_M  (INTERRUPT_CORE0_BT_BB_INTR_MAP_V << INTERRUPT_CORE0_BT_BB_INTR_MAP_S)
#define INTERRUPT_CORE0_BT_BB_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_BT_BB_INTR_MAP_S  0
/** INTERRUPT_CORE0_BT_BB_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_BT_BB_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_BT_BB_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_BT_BB_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_BT_BB_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_BT_BB_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_BT_BB_INTR_PASS_IN_SEC_S  8

