espressif/esp-stub-lib/src/target/esp32c61/include/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_BT_BB_NMI_MAP_REG register
 *  BT_BB_NMI mapping register
 */
#define INTERRUPT_CORE0_BT_BB_NMI_MAP_REG (DR_REG_INTMTX_BASE + 0x18)
/** INTERRUPT_CORE0_BT_BB_NMI_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_BT_BB_NMI_MAP    0x0000003FU
#define INTERRUPT_CORE0_BT_BB_NMI_MAP_M  (INTERRUPT_CORE0_BT_BB_NMI_MAP_V << INTERRUPT_CORE0_BT_BB_NMI_MAP_S)
#define INTERRUPT_CORE0_BT_BB_NMI_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_BT_BB_NMI_MAP_S  0
/** INTERRUPT_CORE0_BT_BB_NMI_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_BT_BB_NMI_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_BT_BB_NMI_PASS_IN_SEC_M  (INTERRUPT_CORE0_BT_BB_NMI_PASS_IN_SEC_V << INTERRUPT_CORE0_BT_BB_NMI_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_BT_BB_NMI_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_BT_BB_NMI_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_LP_TIMER_INTR_MAP_REG register
 *  LP_TIMER_INTR mapping register
 */
#define INTERRUPT_CORE0_LP_TIMER_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x1c)
/** INTERRUPT_CORE0_LP_TIMER_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LP_TIMER_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_TIMER_INTR_MAP_M  (INTERRUPT_CORE0_LP_TIMER_INTR_MAP_V << INTERRUPT_CORE0_LP_TIMER_INTR_MAP_S)
#define INTERRUPT_CORE0_LP_TIMER_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_TIMER_INTR_MAP_S  0
/** INTERRUPT_CORE0_LP_TIMER_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_LP_TIMER_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_LP_TIMER_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_LP_TIMER_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_LP_TIMER_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_LP_TIMER_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_LP_TIMER_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_COEX_INTR_MAP_REG register
 *  COEX_INTR mapping register
 */
#define INTERRUPT_CORE0_COEX_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x20)
/** INTERRUPT_CORE0_COEX_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_COEX_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_COEX_INTR_MAP_M  (INTERRUPT_CORE0_COEX_INTR_MAP_V << INTERRUPT_CORE0_COEX_INTR_MAP_S)
#define INTERRUPT_CORE0_COEX_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_COEX_INTR_MAP_S  0
/** INTERRUPT_CORE0_COEX_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_COEX_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_COEX_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_COEX_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_COEX_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_COEX_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_COEX_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_BLE_TIMER_INTR_MAP_REG register
 *  BLE_TIMER_INTR mapping register
 */
#define INTERRUPT_CORE0_BLE_TIMER_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x24)
/** INTERRUPT_CORE0_BLE_TIMER_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_BLE_TIMER_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_BLE_TIMER_INTR_MAP_M  (INTERRUPT_CORE0_BLE_TIMER_INTR_MAP_V << INTERRUPT_CORE0_BLE_TIMER_INTR_MAP_S)
#define INTERRUPT_CORE0_BLE_TIMER_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_BLE_TIMER_INTR_MAP_S  0
/** INTERRUPT_CORE0_BLE_TIMER_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_BLE_TIMER_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_BLE_TIMER_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_BLE_TIMER_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_BLE_TIMER_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_BLE_TIMER_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_BLE_TIMER_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_BLE_SEC_INTR_MAP_REG register
 *  BLE_SEC_INTR mapping register
 */
#define INTERRUPT_CORE0_BLE_SEC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x28)
/** INTERRUPT_CORE0_BLE_SEC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_BLE_SEC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_BLE_SEC_INTR_MAP_M  (INTERRUPT_CORE0_BLE_SEC_INTR_MAP_V << INTERRUPT_CORE0_BLE_SEC_INTR_MAP_S)
#define INTERRUPT_CORE0_BLE_SEC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_BLE_SEC_INTR_MAP_S  0
/** INTERRUPT_CORE0_BLE_SEC_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_BLE_SEC_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_BLE_SEC_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_BLE_SEC_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_BLE_SEC_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_BLE_SEC_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_BLE_SEC_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_I2C_MST_INTR_MAP_REG register
 *  I2C_MST_INTR mapping register
 */
#define INTERRUPT_CORE0_I2C_MST_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x2c)
/** INTERRUPT_CORE0_I2C_MST_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_I2C_MST_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_I2C_MST_INTR_MAP_M  (INTERRUPT_CORE0_I2C_MST_INTR_MAP_V << INTERRUPT_CORE0_I2C_MST_INTR_MAP_S)
#define INTERRUPT_CORE0_I2C_MST_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_I2C_MST_INTR_MAP_S  0
/** INTERRUPT_CORE0_I2C_MST_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_I2C_MST_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_I2C_MST_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_I2C_MST_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_I2C_MST_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_I2C_MST_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_I2C_MST_INTR_PASS_IN_SEC_S  8

