espressif/esp-stub-lib/src/target/esp32c61/include/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_CACHE_INTR_MAP_REG register
 *  CACHE_INTR mapping register
 */
#define INTERRUPT_CORE0_CACHE_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x64)
/** INTERRUPT_CORE0_CACHE_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_CACHE_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_CACHE_INTR_MAP_M  (INTERRUPT_CORE0_CACHE_INTR_MAP_V << INTERRUPT_CORE0_CACHE_INTR_MAP_S)
#define INTERRUPT_CORE0_CACHE_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CACHE_INTR_MAP_S  0
/** INTERRUPT_CORE0_CACHE_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_CACHE_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_CACHE_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_CACHE_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_CACHE_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_CACHE_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_CACHE_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_MAP_REG register
 *  CPU_PERI_TIMEOUT_INTR mapping register
 */
#define INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x68)
/** INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_MAP_M  (INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_MAP_V << INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_MAP_S)
#define INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_MAP_S  0
/** INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_CPU_PERI_TIMEOUT_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP_REG register
 *  GPIO_INTERRUPT_PRO mapping register
 */
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP_REG (DR_REG_INTMTX_BASE + 0x6c)
/** INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP    0x0000003FU
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP_M  (INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP_V << INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP_S)
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP_S  0
/** INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_PASS_IN_SEC_M  (INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_PASS_IN_SEC_V << INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_MAP_REG register
 *  GPIO_INTERRUPT_EXT mapping register
 */
#define INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_MAP_REG (DR_REG_INTMTX_BASE + 0x70)
/** INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_MAP    0x0000003FU
#define INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_MAP_M  (INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_MAP_V << INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_MAP_S)
#define INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_MAP_S  0
/** INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_PASS_IN_SEC_M  (INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_PASS_IN_SEC_V << INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_GPIO_INTERRUPT_EXT_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_PAU_INTR_MAP_REG register
 *  PAU_INTR mapping register
 */
#define INTERRUPT_CORE0_PAU_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x74)
/** INTERRUPT_CORE0_PAU_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_PAU_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_PAU_INTR_MAP_M  (INTERRUPT_CORE0_PAU_INTR_MAP_V << INTERRUPT_CORE0_PAU_INTR_MAP_S)
#define INTERRUPT_CORE0_PAU_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PAU_INTR_MAP_S  0
/** INTERRUPT_CORE0_PAU_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_PAU_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_PAU_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_PAU_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_PAU_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_PAU_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_PAU_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_MAP_REG register
 *  HP_PERI_TIMEOUT_INTR mapping register
 */
#define INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x78)
/** INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_MAP_M  (INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_MAP_V << INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_MAP_S)
#define INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_MAP_S  0
/** INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_HP_PERI_TIMEOUT_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_MAP_REG register
 *  MODEM_PERI_TIMEOUT_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x7c)
/** INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_MAP_V << INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_MODEM_PERI_TIMEOUT_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_HP_APM_M0_INTR_MAP_REG register
 *  HP_APM_M0_INTR mapping register
 */
#define INTERRUPT_CORE0_HP_APM_M0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x80)
/** INTERRUPT_CORE0_HP_APM_M0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_HP_APM_M0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_APM_M0_INTR_MAP_M  (INTERRUPT_CORE0_HP_APM_M0_INTR_MAP_V << INTERRUPT_CORE0_HP_APM_M0_INTR_MAP_S)
#define INTERRUPT_CORE0_HP_APM_M0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_APM_M0_INTR_MAP_S  0
/** INTERRUPT_CORE0_HP_APM_M0_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_HP_APM_M0_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_HP_APM_M0_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_HP_APM_M0_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_HP_APM_M0_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_HP_APM_M0_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_HP_APM_M0_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_HP_APM_M1_INTR_MAP_REG register
 *  HP_APM_M1_INTR mapping register
 */
#define INTERRUPT_CORE0_HP_APM_M1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x84)
/** INTERRUPT_CORE0_HP_APM_M1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_HP_APM_M1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_APM_M1_INTR_MAP_M  (INTERRUPT_CORE0_HP_APM_M1_INTR_MAP_V << INTERRUPT_CORE0_HP_APM_M1_INTR_MAP_S)
#define INTERRUPT_CORE0_HP_APM_M1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_APM_M1_INTR_MAP_S  0
/** INTERRUPT_CORE0_HP_APM_M1_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_HP_APM_M1_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_HP_APM_M1_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_HP_APM_M1_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_HP_APM_M1_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_HP_APM_M1_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_HP_APM_M1_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_HP_APM_M2_INTR_MAP_REG register
 *  HP_APM_M2_INTR mapping register
 */
#define INTERRUPT_CORE0_HP_APM_M2_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x88)
/** INTERRUPT_CORE0_HP_APM_M2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_HP_APM_M2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_APM_M2_INTR_MAP_M  (INTERRUPT_CORE0_HP_APM_M2_INTR_MAP_V << INTERRUPT_CORE0_HP_APM_M2_INTR_MAP_S)
#define INTERRUPT_CORE0_HP_APM_M2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_APM_M2_INTR_MAP_S  0
/** INTERRUPT_CORE0_HP_APM_M2_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_HP_APM_M2_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_HP_APM_M2_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_HP_APM_M2_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_HP_APM_M2_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_HP_APM_M2_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_HP_APM_M2_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_HP_APM_M3_INTR_MAP_REG register
 *  HP_APM_M3_INTR mapping register
 */
#define INTERRUPT_CORE0_HP_APM_M3_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x8c)
/** INTERRUPT_CORE0_HP_APM_M3_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_HP_APM_M3_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_APM_M3_INTR_MAP_M  (INTERRUPT_CORE0_HP_APM_M3_INTR_MAP_V << INTERRUPT_CORE0_HP_APM_M3_INTR_MAP_S)
#define INTERRUPT_CORE0_HP_APM_M3_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_APM_M3_INTR_MAP_S  0
/** INTERRUPT_CORE0_HP_APM_M3_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_HP_APM_M3_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_HP_APM_M3_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_HP_APM_M3_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_HP_APM_M3_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_HP_APM_M3_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_HP_APM_M3_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_CPU_APM_M0_INTR_MAP_REG register
 *  CPU_APM_M0_INTR mapping register
 */
#define INTERRUPT_CORE0_CPU_APM_M0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x90)
/** INTERRUPT_CORE0_CPU_APM_M0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_CPU_APM_M0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_CPU_APM_M0_INTR_MAP_M  (INTERRUPT_CORE0_CPU_APM_M0_INTR_MAP_V << INTERRUPT_CORE0_CPU_APM_M0_INTR_MAP_S)
#define INTERRUPT_CORE0_CPU_APM_M0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CPU_APM_M0_INTR_MAP_S  0
/** INTERRUPT_CORE0_CPU_APM_M0_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_CPU_APM_M0_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_CPU_APM_M0_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_CPU_APM_M0_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_CPU_APM_M0_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_CPU_APM_M0_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_CPU_APM_M0_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_CPU_APM_M1_INTR_MAP_REG register
 *  CPU_APM_M1_INTR mapping register
 */
#define INTERRUPT_CORE0_CPU_APM_M1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x94)
/** INTERRUPT_CORE0_CPU_APM_M1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_CPU_APM_M1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_CPU_APM_M1_INTR_MAP_M  (INTERRUPT_CORE0_CPU_APM_M1_INTR_MAP_V << INTERRUPT_CORE0_CPU_APM_M1_INTR_MAP_S)
#define INTERRUPT_CORE0_CPU_APM_M1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CPU_APM_M1_INTR_MAP_S  0
/** INTERRUPT_CORE0_CPU_APM_M1_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_CPU_APM_M1_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_CPU_APM_M1_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_CPU_APM_M1_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_CPU_APM_M1_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_CPU_APM_M1_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_CPU_APM_M1_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_MSPI_INTR_MAP_REG register
 *  MSPI_INTR mapping register
 */
#define INTERRUPT_CORE0_MSPI_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x98)
/** INTERRUPT_CORE0_MSPI_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MSPI_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MSPI_INTR_MAP_M  (INTERRUPT_CORE0_MSPI_INTR_MAP_V << INTERRUPT_CORE0_MSPI_INTR_MAP_S)
#define INTERRUPT_CORE0_MSPI_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MSPI_INTR_MAP_S  0
/** INTERRUPT_CORE0_MSPI_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_MSPI_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_MSPI_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_MSPI_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_MSPI_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_MSPI_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_MSPI_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_I2S1_INTR_MAP_REG register
 *  I2S1_INTR mapping register
 */
#define INTERRUPT_CORE0_I2S1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x9c)
/** INTERRUPT_CORE0_I2S1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_I2S1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_I2S1_INTR_MAP_M  (INTERRUPT_CORE0_I2S1_INTR_MAP_V << INTERRUPT_CORE0_I2S1_INTR_MAP_S)
#define INTERRUPT_CORE0_I2S1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_I2S1_INTR_MAP_S  0
/** INTERRUPT_CORE0_I2S1_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_I2S1_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_I2S1_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_I2S1_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_I2S1_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_I2S1_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_I2S1_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_UART0_INTR_MAP_REG register
 *  UART0_INTR mapping register
 */
#define INTERRUPT_CORE0_UART0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xa0)
/** INTERRUPT_CORE0_UART0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_UART0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_UART0_INTR_MAP_M  (INTERRUPT_CORE0_UART0_INTR_MAP_V << INTERRUPT_CORE0_UART0_INTR_MAP_S)
#define INTERRUPT_CORE0_UART0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_UART0_INTR_MAP_S  0
/** INTERRUPT_CORE0_UART0_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_UART0_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_UART0_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_UART0_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_UART0_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_UART0_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_UART0_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_UART1_INTR_MAP_REG register
 *  UART1_INTR mapping register
 */
#define INTERRUPT_CORE0_UART1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xa4)
/** INTERRUPT_CORE0_UART1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_UART1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_UART1_INTR_MAP_M  (INTERRUPT_CORE0_UART1_INTR_MAP_V << INTERRUPT_CORE0_UART1_INTR_MAP_S)
#define INTERRUPT_CORE0_UART1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_UART1_INTR_MAP_S  0
/** INTERRUPT_CORE0_UART1_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_UART1_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_UART1_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_UART1_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_UART1_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_UART1_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_UART1_INTR_PASS_IN_SEC_S  8

