espressif/esp-stub-lib/src/target/esp32c61/include/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_UART2_INTR_MAP_REG register
 *  UART2_INTR mapping register
 */
#define INTERRUPT_CORE0_UART2_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xa8)
/** INTERRUPT_CORE0_UART2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_UART2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_UART2_INTR_MAP_M  (INTERRUPT_CORE0_UART2_INTR_MAP_V << INTERRUPT_CORE0_UART2_INTR_MAP_S)
#define INTERRUPT_CORE0_UART2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_UART2_INTR_MAP_S  0
/** INTERRUPT_CORE0_UART2_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_UART2_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_UART2_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_UART2_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_UART2_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_UART2_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_UART2_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_LEDC_INTR_MAP_REG register
 *  LEDC_INTR mapping register
 */
#define INTERRUPT_CORE0_LEDC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xac)
/** INTERRUPT_CORE0_LEDC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LEDC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LEDC_INTR_MAP_M  (INTERRUPT_CORE0_LEDC_INTR_MAP_V << INTERRUPT_CORE0_LEDC_INTR_MAP_S)
#define INTERRUPT_CORE0_LEDC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LEDC_INTR_MAP_S  0
/** INTERRUPT_CORE0_LEDC_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_LEDC_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_LEDC_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_LEDC_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_LEDC_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_LEDC_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_LEDC_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_USB_INTR_MAP_REG register
 *  USB_INTR mapping register
 */
#define INTERRUPT_CORE0_USB_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xb0)
/** INTERRUPT_CORE0_USB_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_USB_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_USB_INTR_MAP_M  (INTERRUPT_CORE0_USB_INTR_MAP_V << INTERRUPT_CORE0_USB_INTR_MAP_S)
#define INTERRUPT_CORE0_USB_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_USB_INTR_MAP_S  0
/** INTERRUPT_CORE0_USB_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_USB_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_USB_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_USB_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_USB_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_USB_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_USB_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_REG register
 *  I2C_EXT0_INTR mapping register
 */
#define INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xb4)
/** INTERRUPT_CORE0_I2C_EXT0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_I2C_EXT0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_M  (INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_V << INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_S)
#define INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_S  0
/** INTERRUPT_CORE0_I2C_EXT0_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_I2C_EXT0_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_I2C_EXT0_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_I2C_EXT0_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_I2C_EXT0_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_I2C_EXT0_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_I2C_EXT0_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_TG0_T0_INTR_MAP_REG register
 *  TG0_T0_INTR mapping register
 */
#define INTERRUPT_CORE0_TG0_T0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xb8)
/** INTERRUPT_CORE0_TG0_T0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_TG0_T0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_TG0_T0_INTR_MAP_M  (INTERRUPT_CORE0_TG0_T0_INTR_MAP_V << INTERRUPT_CORE0_TG0_T0_INTR_MAP_S)
#define INTERRUPT_CORE0_TG0_T0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TG0_T0_INTR_MAP_S  0
/** INTERRUPT_CORE0_TG0_T0_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_TG0_T0_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_TG0_T0_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_TG0_T0_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_TG0_T0_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_TG0_T0_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_TG0_T0_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_TG0_T1_INTR_MAP_REG register
 *  TG0_T1_INTR mapping register
 */
#define INTERRUPT_CORE0_TG0_T1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xbc)
/** INTERRUPT_CORE0_TG0_T1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_TG0_T1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_TG0_T1_INTR_MAP_M  (INTERRUPT_CORE0_TG0_T1_INTR_MAP_V << INTERRUPT_CORE0_TG0_T1_INTR_MAP_S)
#define INTERRUPT_CORE0_TG0_T1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TG0_T1_INTR_MAP_S  0
/** INTERRUPT_CORE0_TG0_T1_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_TG0_T1_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_TG0_T1_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_TG0_T1_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_TG0_T1_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_TG0_T1_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_TG0_T1_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_TG0_WDT_INTR_MAP_REG register
 *  TG0_WDT_INTR mapping register
 */
#define INTERRUPT_CORE0_TG0_WDT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xc0)
/** INTERRUPT_CORE0_TG0_WDT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_TG0_WDT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_TG0_WDT_INTR_MAP_M  (INTERRUPT_CORE0_TG0_WDT_INTR_MAP_V << INTERRUPT_CORE0_TG0_WDT_INTR_MAP_S)
#define INTERRUPT_CORE0_TG0_WDT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TG0_WDT_INTR_MAP_S  0
/** INTERRUPT_CORE0_TG0_WDT_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_TG0_WDT_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_TG0_WDT_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_TG0_WDT_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_TG0_WDT_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_TG0_WDT_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_TG0_WDT_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_TG1_T0_INTR_MAP_REG register
 *  TG1_T0_INTR mapping register
 */
#define INTERRUPT_CORE0_TG1_T0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xc4)
/** INTERRUPT_CORE0_TG1_T0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_TG1_T0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_TG1_T0_INTR_MAP_M  (INTERRUPT_CORE0_TG1_T0_INTR_MAP_V << INTERRUPT_CORE0_TG1_T0_INTR_MAP_S)
#define INTERRUPT_CORE0_TG1_T0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TG1_T0_INTR_MAP_S  0
/** INTERRUPT_CORE0_TG1_T0_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_TG1_T0_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_TG1_T0_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_TG1_T0_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_TG1_T0_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_TG1_T0_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_TG1_T0_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_TG1_T1_INTR_MAP_REG register
 *  TG1_T1_INTR mapping register
 */
#define INTERRUPT_CORE0_TG1_T1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xc8)
/** INTERRUPT_CORE0_TG1_T1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_TG1_T1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_TG1_T1_INTR_MAP_M  (INTERRUPT_CORE0_TG1_T1_INTR_MAP_V << INTERRUPT_CORE0_TG1_T1_INTR_MAP_S)
#define INTERRUPT_CORE0_TG1_T1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TG1_T1_INTR_MAP_S  0
/** INTERRUPT_CORE0_TG1_T1_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_TG1_T1_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_TG1_T1_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_TG1_T1_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_TG1_T1_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_TG1_T1_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_TG1_T1_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_TG1_WDT_INTR_MAP_REG register
 *  TG1_WDT_INTR mapping register
 */
#define INTERRUPT_CORE0_TG1_WDT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xcc)
/** INTERRUPT_CORE0_TG1_WDT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_TG1_WDT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_TG1_WDT_INTR_MAP_M  (INTERRUPT_CORE0_TG1_WDT_INTR_MAP_V << INTERRUPT_CORE0_TG1_WDT_INTR_MAP_S)
#define INTERRUPT_CORE0_TG1_WDT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TG1_WDT_INTR_MAP_S  0
/** INTERRUPT_CORE0_TG1_WDT_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_TG1_WDT_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_TG1_WDT_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_TG1_WDT_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_TG1_WDT_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_TG1_WDT_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_TG1_WDT_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP_REG register
 *  SYSTIMER_TARGET0_INTR mapping register
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xd0)
/** INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP_M  (INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP_V << INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP_S  0
/** INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP_REG register
 *  SYSTIMER_TARGET1_INTR mapping register
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xd4)
/** INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP_M  (INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP_V << INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP_S  0
/** INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP_REG register
 *  SYSTIMER_TARGET2_INTR mapping register
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xd8)
/** INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP_M  (INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP_V << INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP_S  0
/** INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_APB_ADC_INTR_MAP_REG register
 *  APB_ADC_INTR mapping register
 */
#define INTERRUPT_CORE0_APB_ADC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xdc)
/** INTERRUPT_CORE0_APB_ADC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_APB_ADC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_APB_ADC_INTR_MAP_M  (INTERRUPT_CORE0_APB_ADC_INTR_MAP_V << INTERRUPT_CORE0_APB_ADC_INTR_MAP_S)
#define INTERRUPT_CORE0_APB_ADC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_APB_ADC_INTR_MAP_S  0
/** INTERRUPT_CORE0_APB_ADC_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_APB_ADC_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_APB_ADC_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_APB_ADC_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_APB_ADC_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_APB_ADC_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_APB_ADC_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_SLC0_INTR_MAP_REG register
 *  SLC0_INTR mapping register
 */
#define INTERRUPT_CORE0_SLC0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xe0)
/** INTERRUPT_CORE0_SLC0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_SLC0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_SLC0_INTR_MAP_M  (INTERRUPT_CORE0_SLC0_INTR_MAP_V << INTERRUPT_CORE0_SLC0_INTR_MAP_S)
#define INTERRUPT_CORE0_SLC0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SLC0_INTR_MAP_S  0
/** INTERRUPT_CORE0_SLC0_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_SLC0_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_SLC0_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_SLC0_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_SLC0_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_SLC0_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_SLC0_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_SLC1_INTR_MAP_REG register
 *  SLC1_INTR mapping register
 */
#define INTERRUPT_CORE0_SLC1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xe4)
/** INTERRUPT_CORE0_SLC1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_SLC1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_SLC1_INTR_MAP_M  (INTERRUPT_CORE0_SLC1_INTR_MAP_V << INTERRUPT_CORE0_SLC1_INTR_MAP_S)
#define INTERRUPT_CORE0_SLC1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SLC1_INTR_MAP_S  0
/** INTERRUPT_CORE0_SLC1_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_SLC1_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_SLC1_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_SLC1_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_SLC1_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_SLC1_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_SLC1_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_REG register
 *  DMA_IN_CH0_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xe8)
/** INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_M  (INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_V << INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_MAP_S  0
/** INTERRUPT_CORE0_DMA_IN_CH0_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_DMA_IN_CH0_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_DMA_IN_CH0_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_DMA_IN_CH0_INTR_PASS_IN_SEC_S  8

/** INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_REG register
 *  DMA_IN_CH1_INTR mapping register
 */
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xec)
/** INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_M  (INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_V << INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_MAP_S  0
/** INTERRUPT_CORE0_DMA_IN_CH1_INTR_PASS_IN_SEC : R/W; bitpos: [8]; default: 0;
 *  Configures the PASS_IN_SEC flag of the interrupt source.
 */
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_PASS_IN_SEC    (BIT(8))
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_PASS_IN_SEC_M  (INTERRUPT_CORE0_DMA_IN_CH1_INTR_PASS_IN_SEC_V << INTERRUPT_CORE0_DMA_IN_CH1_INTR_PASS_IN_SEC_S)
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_PASS_IN_SEC_V  0x00000001U
#define INTERRUPT_CORE0_DMA_IN_CH1_INTR_PASS_IN_SEC_S  8

