espressif/esp-stub-lib/src/target/esp32c61/include/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_INT_STATUS_REG_0_REG register
 *  Status register for interrupt sources 0 ~ 31
 */
#define INTERRUPT_CORE0_INT_STATUS_REG_0_REG (DR_REG_INTMTX_BASE + 0x108)
/** INTERRUPT_CORE0_INT_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  Represents the status of the interrupt sources within interrupt-index-range 0 ~ 31.
 *  Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source triggered an interrupt
 *  1:No interrupt triggered
 */
#define INTERRUPT_CORE0_INT_STATUS_0    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_0_M  (INTERRUPT_CORE0_INT_STATUS_0_V << INTERRUPT_CORE0_INT_STATUS_0_S)
#define INTERRUPT_CORE0_INT_STATUS_0_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_0_S  0

/** INTERRUPT_CORE0_INT_STATUS_REG_1_REG register
 *  Status register for interrupt sources 32 ~ 63
 */
#define INTERRUPT_CORE0_INT_STATUS_REG_1_REG (DR_REG_INTMTX_BASE + 0x10c)
/** INTERRUPT_CORE0_INT_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the status of the interrupt sources within interrupt-index-range 32 ~
 *  63. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source triggered an interrupt
 *  1:No interrupt triggered
 */
#define INTERRUPT_CORE0_INT_STATUS_1    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_1_M  (INTERRUPT_CORE0_INT_STATUS_1_V << INTERRUPT_CORE0_INT_STATUS_1_S)
#define INTERRUPT_CORE0_INT_STATUS_1_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_1_S  0

/** INTERRUPT_CORE0_INT_STATUS_REG_2_REG register
 *  Status register for interrupt sources 64 ~ 65
 */
#define INTERRUPT_CORE0_INT_STATUS_REG_2_REG (DR_REG_INTMTX_BASE + 0x110)
/** INTERRUPT_CORE0_INT_STATUS_2 : RO; bitpos: [1:0]; default: 0;
 *  Represents the status of the interrupt sources within interrupt-index-range 64 ~
 *  65. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source triggered an interrupt
 *  1:No interrupt triggered
 */
#define INTERRUPT_CORE0_INT_STATUS_2    0x00000003U
#define INTERRUPT_CORE0_INT_STATUS_2_M  (INTERRUPT_CORE0_INT_STATUS_2_V << INTERRUPT_CORE0_INT_STATUS_2_S)
#define INTERRUPT_CORE0_INT_STATUS_2_V  0x00000003U
#define INTERRUPT_CORE0_INT_STATUS_2_S  0

/** INTERRUPT_CORE0_SRC_PASS_IN_SEC_STATUS_0_REG register
 *  PASS_IN_SEC status register for interrupt sources 0 ~ 31
 */
#define INTERRUPT_CORE0_SRC_PASS_IN_SEC_STATUS_0_REG (DR_REG_INTMTX_BASE + 0x114)
/** INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  Represents the PASS_IN_SEC status of the interrupt sources within
 *  interrupt-index-range 0 ~ 31. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source is not PASS_IN_SEC.
 *  1:The corresponding interrupt source is PASS_IN_SEC.
 */
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_0    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_0_M  (INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_0_V << INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_0_S)
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_0_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_0_S  0

/** INTERRUPT_CORE0_SRC_PASS_IN_SEC_STATUS_1_REG register
 *  PASS_IN_SEC status register for interrupt sources 32 ~ 63
 */
#define INTERRUPT_CORE0_SRC_PASS_IN_SEC_STATUS_1_REG (DR_REG_INTMTX_BASE + 0x118)
/** INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the PASS_IN_SEC status of the interrupt sources within
 *  interrupt-index-range 32 ~ 63. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source is not PASS_IN_SEC.
 *  1:The corresponding interrupt source is PASS_IN_SEC.
 */
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_1    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_1_M  (INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_1_V << INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_1_S)
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_1_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_1_S  0

/** INTERRUPT_CORE0_SRC_PASS_IN_SEC_STATUS_2_REG register
 *  PASS_IN_SEC status register for interrupt sources 64 ~ 65
 */
#define INTERRUPT_CORE0_SRC_PASS_IN_SEC_STATUS_2_REG (DR_REG_INTMTX_BASE + 0x11c)
/** INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_2 : RO; bitpos: [1:0]; default: 0;
 *  Represents the PASS_IN_SEC status of the interrupt sources with
 *  interrupt-index-range 64 ~ 65. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source is not PASS_IN_SEC.
 *  1:The corresponding interrupt source is PASS_IN_SEC.
 */
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_2    0x00000003U
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_2_M  (INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_2_V << INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_2_S)
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_2_V  0x00000003U
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_SEC_STATUS_2_S  0

/** INTERRUPT_CORE0_SIG_IDX_ASSERT_IN_SEC_REG register
 *  reserved
 */
#define INTERRUPT_CORE0_SIG_IDX_ASSERT_IN_SEC_REG (DR_REG_INTMTX_BASE + 0x120)
/** INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_SEC : R/W; bitpos: [5:0]; default: 0;
 *  reserved
 */
#define INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_SEC    0x0000003FU
#define INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_SEC_M  (INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_SEC_V << INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_SEC_S)
#define INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_SEC_V  0x0000003FU
#define INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_SEC_S  0

/** INTERRUPT_CORE0_SECURE_STATUS_REG register
 *  reserved
 */
#define INTERRUPT_CORE0_SECURE_STATUS_REG (DR_REG_INTMTX_BASE + 0x124)
/** INTERRUPT_CORE0_INT_SECURE_STATUS : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define INTERRUPT_CORE0_INT_SECURE_STATUS    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_SECURE_STATUS_M  (INTERRUPT_CORE0_INT_SECURE_STATUS_V << INTERRUPT_CORE0_INT_SECURE_STATUS_S)
#define INTERRUPT_CORE0_INT_SECURE_STATUS_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_SECURE_STATUS_S  0

/** INTERRUPT_CORE0_CLOCK_GATE_REG register
 *  Interrupt clock gating configure register
 */
#define INTERRUPT_CORE0_CLOCK_GATE_REG (DR_REG_INTMTX_BASE + 0x128)
/** INTERRUPT_CORE0_REG_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Interrupt clock gating configure register
 */
#define INTERRUPT_CORE0_REG_CLK_EN    (BIT(0))
#define INTERRUPT_CORE0_REG_CLK_EN_M  (INTERRUPT_CORE0_REG_CLK_EN_V << INTERRUPT_CORE0_REG_CLK_EN_S)
#define INTERRUPT_CORE0_REG_CLK_EN_V  0x00000001U
#define INTERRUPT_CORE0_REG_CLK_EN_S  0

/** INTERRUPT_CORE0_INTERRUPT_DATE_REG register
 *  Version control register
 */
#define INTERRUPT_CORE0_INTERRUPT_DATE_REG (DR_REG_INTMTX_BASE + 0x7fc)
/** INTERRUPT_CORE0_INTERRUPT_DATE : R/W; bitpos: [27:0]; default: 38801441;
 *  Version control register
 */
#define INTERRUPT_CORE0_INTERRUPT_DATE    0x0FFFFFFFU
#define INTERRUPT_CORE0_INTERRUPT_DATE_M  (INTERRUPT_CORE0_INTERRUPT_DATE_V << INTERRUPT_CORE0_INTERRUPT_DATE_S)
#define INTERRUPT_CORE0_INTERRUPT_DATE_V  0x0FFFFFFFU
#define INTERRUPT_CORE0_INTERRUPT_DATE_S  0

#ifdef __cplusplus
}
#endif
